In [21]:
import pandas as pd
import numpy as np

In [23]:
open_text = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex1.csv')

#!cat examples\ex1.csv
#a,b,c,d,message
#1,2,3,4,hello
#5,6,7,8,world
#9,10,11,12,foo

In [25]:
open_text

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
open_text2 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex2.csv', names = ['a','b','c','d','message'])

In [31]:
open_text2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
names = ['a','b','c','d','message']

In [43]:
open_text3 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex1.csv', names = names, index_col ='message')

In [44]:
open_text3

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [46]:
open_text4 = pd.read_csv ('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/csv_mindex.csv', names = names, index_col ='message')

In [47]:
open_text4

            a     b       c       d
message
NaN      key1  key2  value1  value2
NaN       one     a       1       2
NaN       one     b       3       4
NaN       one     c       5       6
NaN       one     d       7       8
NaN       two     a       9      10
NaN       two     b      11      12
NaN       two     c      13      14
NaN       two     d      15      16

In [57]:
### To form a hierarchical index from multiple columns
parsed = pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/csv_mindex.csv', index_col =['key1','key2'])

In [58]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [65]:
### Passing an expression as a delimited for delimiter
result = pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex3.txt', '\s+')

In [66]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [67]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex4.csv')

In [68]:
skip_rows

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [69]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex4.csv', skiprows = [0,2,3])

In [70]:
skip_rows

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [71]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv')

In [72]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [75]:
pd.isnull(skip_rows)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [76]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv', na_values = ['NULL'])

In [77]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [78]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}

In [79]:
skip_rows= pd.read_csv('https://resources.oreilly.com/examples/0636920023784/raw/master/pydata-book-master/ch06/ex5.csv', na_values=sentinels)

In [80]:
skip_rows

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [82]:
import sqlalchemy as sqla

import pandas as pd

db = sqla.create_engine("mysql+pymysql://anonymous:@ensembldb.ensembl.org:3306/aedes_aegypti_core_48_1b")

In [83]:
db

Engine(mysql+pymysql://anonymous:***@ensembldb.ensembl.org:3306/aedes_aegypti_core_48_1b)

In [84]:
import requests

In [85]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [86]:
resp = requests.get(url)

In [87]:
resp

In [88]:
data = resp.json()

In [89]:
data[0]['title']

'CLN: Consistent pandas.util.testing imports in pandas/tests/util'

In [91]:
issues = pd.DataFrame(data,columns=['number','title','labels','state'])

In [92]:
issues

,number,title,labels,state
0,29278,CLN: Consistent pandas.util.testing imports in...,[],open
1,29277,CLN: Consistent pandas.util.testing imports in...,[],open
2,29276,Question: Clarification about the Warnings/Exc...,[],open
3,29275,CLN: update imports in tests,[],open
4,29274,[Minor Fix][Doc]What's New in 1.0.0,[],open
5,29272,CLN: Consistent imports in tests: pandas.util....,[],open
6,29271,BLD: fix some build warnings,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
7,29270,"Reduce Benchmark Times of stat_ops, particular...","[{'id': 732775912, 'node_id': 'MDU6TGFiZWw3MzI...",open
8,29269,Add simple test for GH 28448,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
9,29268,Named aggregations with multiple columns,[],open
10,29267,"API: public way to get the ""best values"" of a ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
11,29266,BLD: ABCSeries mapper maps unmapped categories...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
12,29264,Inconsistent results between `rolling.corr` an...,[],open
13,29261,REF: Pre-empt TypeError in groupby,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
14,29260,Multiindex recurse error fix,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
15,29256,Added whatsnew for 29174,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
16,29254,Fix SS06 Issues in docstrings,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,29252,Bug: Joining MultiIndex with NaNs,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
18,29250,API: consider undeprecating Series.item() ?,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
19,29248,initial HTML rendering for Series,"[{'id': 57395487, 'node_id': 'MDU6TGFiZWw1NzM5...",open
20,29247,ENH: Bulk merge a list of files.,"[{'id': 13098779, 'node_id': 'MDU6TGFiZWwxMzA5...",open
21,29246,REF: Simplify _cython_functions lookup,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
22,29245,ENH: Styler.background_gradient to accept vmin...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
23,29244,REF: use fused types in hashtables,"[{'id': 49094459, 'node_id': 'MDU6TGFiZWw0OTA5...",open
24,29243,Follow up PR: #28097 Simplify branch statement,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
25,29242,config.register_option allows registering inva...,[],open
26,29241,merge vs. join - unify parameter names,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
27,29240,Trying to use to_sql on dataframe with numpy.n...,"[{'id': 47232590, 'node_id': 'MDU6TGFiZWw0NzIz...",open
28,29237,Replace _has_complex_internals #29227,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
29,29235,Categories reordered to alphabetical when plot...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open

In [93]:
import sqlite3

In [109]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), 
 c REAL,        d INTEGER)
;"""

In [110]:
con = sqlite3.connect('mydata.sqlite')

In [111]:
con.execute(query)

In [112]:
con.commit()

In [113]:
data = [('Atlanta','Georgia',1.25,6),
       ('Tallahasse','Florida',2.6,3),
       ('Sacramento','California',1.7,5)]

In [114]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [115]:
con.executemany(stmt, data)

In [116]:
con.commit()

In [117]:
cursor = con.execute('select * from test')

In [118]:
rows = cursor.fetchall()

In [120]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [121]:
data

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [122]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [128]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5

In [135]:
import sqlalchemy as sqla
db= sqla.create_engine("sqlite:///mydata.sqlite")
pd.read_sql("select * from test", db)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Tallahasse     Florida  2.60  3
2  Sacramento  California  1.70  5